{
  "nocturnals": [
    {
      "id": "getting-started",
      "title": "How do I start playing?",
      "body": "<p>Getting started with Nocturnals is easy!</p><ol><li>Download and install the game from Steam</li><li>Launch the game and wait for initial setup</li><li>Choose your character from the character selection screen</li><li>Complete the tutorial to learn basic controls and mechanics</li></ol><p>The tutorial covers movement, jumping, interaction, and basic combat. Don't worry if you need to reference controls later - you can access the control guide anytime from the pause menu.</p>"
    },
    {
      "id": "system-requirements",
      "title": "What are the system requirements?",
      "body": "<p>Nocturnals has modest system requirements:</p><h4>Minimum Requirements:</h4><ul><li>OS: Windows 10 64-bit</li><li>Processor: Intel i3-4130 / AMD FX-4300</li><li>Memory: 4 GB RAM</li><li>Graphics: DirectX 11 compatible</li><li>Storage: 2 GB available space</li></ul><h4>Recommended:</h4><ul><li>OS: Windows 11 64-bit</li><li>Processor: Intel i5-8400 / AMD Ryzen 5 2600</li><li>Memory: 8 GB RAM</li><li>Graphics: GTX 1060 / RX 580 or better</li><li>Storage: 4 GB available space (SSD recommended)</li></ul>"
    },
    {
      "id": "multiplayer",
      "title": "Can I play with friends?",
      "body": "<p>Yes! Nocturnals supports local multiplayer for up to 4 players.</p><p>To start a multiplayer session:</p><ol><li>From the main menu, select \"Multiplayer\"</li><li>Choose \"Local Co-op\"</li><li>Connect up to 4 controllers (Xbox and PlayStation controllers supported)</li><li>Select your characters and start playing!</li></ol><p>Each player can choose from the same roster of characters, and progress is shared among all players. Local multiplayer uses split-screen when players are far apart, and a shared camera when they're close together.</p>"
    },
    {
      "id": "save-progress",
      "title": "How do I save my progress?",
      "body": "<p>Nocturnals uses an automatic save system - you don't need to manually save your game.</p><p>Your progress is saved automatically at:</p><ul><li>Checkpoints: Regular save points throughout levels</li><li>Level completion: After finishing any level</li><li>Character upgrades: When you unlock new abilities</li><li>Settings changes: When you modify game options</li></ul><p>If you're playing on Steam, your save data is also backed up to Steam Cloud, so you can continue your progress on different computers.</p><p><em>Note: The game saves automatically, but avoid closing the game during the \"Saving...\" indicator to prevent data loss.</em></p>"
    },
    {
      "id": "controls",
      "title": "What controls do I use?",
      "body": "<p>Nocturnals supports both keyboard/mouse and controller input:</p><h4>Keyboard Controls:</h4><ul><li>WASD: Move character</li><li>Space: Jump</li><li>Mouse: Aim and interact</li><li>Left Click: Primary action/attack</li><li>Right Click:</b> Secondary action</li><li>E: Interact with objects</li><li>ESC: Pause menu</li><li>Tab: Inventory/character screen</li></ul><h4>Controller Support:</h4><p>Xbox and PlayStation controllers are fully supported with haptic feedback. Controller mappings can be customized in the settings menu.</p><p>You can also remap any keyboard controls in Settings > Controls.</p>"
    },
    {
      "id": "graphics-settings",
      "title": "How do I change graphics settings?",
      "body": "<p>Graphics settings can be accessed from multiple locations:</p><h4>From Main Menu:</h4><ol><li>Click \"Settings\" from the main menu</li><li>Select \"Graphics\" tab</li><li>Adjust settings and click \"Apply\"</li></ol><h4>During Gameplay:</h4><ol><li>Press ESC to open pause menu</li><li>Select \"Settings\"</li><li>Navigate to \"Graphics\" tab</li></ul><h4>Available Options:</h4><ul><li>Resolution: Display resolution</li><li>Display Mode: Fullscreen, windowed, borderless</li><li>Quality Preset: Low, Medium, High, Ultra</li><li>VSync: On/Off</li><li>Frame Rate Limit: 30/60/120/Unlimited</li></ul><p>Changes take effect immediately, and the game will remember your preferences.</p>"
    },
    {
      "id": "controller-support",
      "title": "Can I use a controller?",
      "body": "<p>Yes! Nocturnals has excellent controller support.</p><h4>Supported Controllers:</h4><ul><li>Xbox controllers: Xbox One, Xbox Series X/S (wired and wireless)</li><li>PlayStation controllers: PS4 DualShock 4, PS5 DualSense (wired and wireless)</li><li>Generic controllers: Most DirectInput and XInput compatible controllers</li></ul><h4>Features:</h4><ul><li>Haptic feedback: Controller vibration for immersive gameplay</li><li>Custom mapping: Remap any button in settings</li><li>Multiple controllers: Support for up to 4 controllers simultaneously</li><li>Automatic detection: Plug and play - no additional setup required</li></ul><p>If your controller isn't detected, try using Steam's controller support or check our troubleshooting guide.</p>"
    },
    {
      "id": "bug-reporting",
      "title": "How do I report bugs?",
      "body": "<p>We appreciate bug reports! Here's how to help us fix issues:</p><h4>Best Methods:</h4><ul><li>Discord: Join our <a href='https://discord.gg/invite/cowboy-toad-games-967203768867356674' target='_blank'>Discord server</a> and use the #bug-reports channel</li><li>Email: Send details to <a href='mailto:team@cowboytoad.games'>team@cowboytoad.games</a></li></ul><h4>What to Include:</h4><ul><li>Description: What happened vs. what you expected</li><li>Steps to reproduce: How to trigger the bug</li><li>System info: OS, graphics card, controller type</li><li>Screenshots/video: Visual evidence if applicable</li><li>Save file: If the bug affects progression</li></ul><p>We aim to respond to all bug reports within 72 hours. Critical bugs that prevent gameplay are our highest priority.</p>"
    }
  ],
  "nocturnals-cacti-coast": [
    {
      "id": "release-date",
      "title": "When will Cacti Coast be released?",
      "body": "<p>Nocturnals: Cacti Coast is currently in active development.</p><p>While we don't have a specific release date yet, we're targeting late 2025 for the initial PC release. We want to ensure the game meets our quality standards and provides the experience our community deserves.</p><p>Stay updated:</p><ul><li>Wishlist on Steam to get notified the moment we announce a release date</li><li>Join our Discord for development updates and behind-the-scenes content</li><li>Follow our social media for regular progress updates</li></ul><p>We'll be sharing more details about release timing as development progresses!</p>"
    },
    {
      "id": "save-compatibility",
      "title": "Will my Nocturnals save carry over?",
      "body": "<p>We're actively working on save data compatibility between Nocturnals and Cacti Coast.</p><p>What we're planning:</p><ul><li>Character unlocks: Your unlocked characters should carry over</li><li>Achievement progress: Completed achievements will be recognized</li><li>Cosmetic items: Any unlocked cosmetics will transfer</li><li>Story progression: Completed story milestones will be acknowledged</li></ul><p>What might not transfer:</p><ul><li>Specific save file positions (Cacti Coast has new levels)</li><li>Some technical settings that may change</li></ul><p>This is still being finalized during development, but save compatibility is a priority for us. We'll provide more details as we get closer to release.</p>"
    },
    {
      "id": "new-features",
      "title": "What new features are planned?",
      "body": "<p>Cacti Coast will significantly expand on the original Nocturnals experience:</p><h4>New Content:</h4><ul><li>3 New Biomes: Desert, Oasis, and Underground Caverns</li><li>Enhanced Story: Deeper character development and new storylines</li><li>New Characters: Additional playable characters with unique abilities</li><li>Extended Campaign: 50% more content than the original</li></ul><h4>Gameplay Improvements:</h4><ul><li>Online Multiplayer: Play with friends across the internet</li><li>Character Customization: Customize appearance and abilities</li><li>Dynamic Weather: Weather effects that impact gameplay</li><li>Improved Combat: More responsive and varied combat system</li></ul><h4>Technical Enhancements:</h4><ul><li>Enhanced Graphics: Improved lighting and visual effects</li><li>Better Performance: Optimized for a wider range of hardware</li><li>Accessibility: More accessibility options for different players</li></ul>"
    },
    {
      "id": "beta-access",
      "title": "Can I play the beta?",
      "body": "<p>We're planning a beta test program for Cacti Coast!</p><p>Beta Timeline:</p><ul><li>Closed Beta: Mid-2025 for selected community members</li><li>Open Beta: Late 2025, closer to release</li></ul><p>How to get Beta Access:</p><ul><li>Discord Members: Beta invitations will be announced in our Discord server first</li><li>Steam Wishlist: Wishlist the game for potential beta key distribution</li><li>Community Participation: Active community members may receive priority access</li></ul><p>What to Expect in Beta:</p><ul><li>Early access to new features and content</li><li>Opportunity to provide feedback that shapes the final game</li><li>Exclusive beta cosmetic rewards</li><li>Direct interaction with the development team</li></ul><p>Join our Discord to be first in line for beta announcements!</p>"
    },
    {
      "id": "platforms",
      "title": "What platforms will it support?",
      "body": "<p>Cacti Coast will launch on multiple platforms, with a staggered release schedule:</p><h4>Launch Platforms (Late 2025):</h4><ul><li>PC (Steam): Windows, with potential Mac/Linux support</li><li>Steam Deck: Verified compatibility at launch</li></ul><h4>Console Versions (2026):</h4><ul><li>Nintendo Switch: Optimized for handheld and docked play</li><li>PlayStation 5: Enhanced with DualSense haptic feedback</li><li>Xbox Series X/S: Optimized for both console variants</li></ul><h4>Why the Staggered Release?</h4><p>We want to ensure each platform gets the attention it deserves. Starting with PC allows us to:</p><ul><li>Gather community feedback and polish the experience</li><li>Optimize performance for each console's unique capabilities</li><li>Implement platform-specific features (like Nintendo Switch's portability)</li></ul><p>Console players who wishlist on their platform of choice will be notified as soon as those versions are available!</p>"
    },
    {
      "id": "online-multiplayer",
      "title": "Will there be new multiplayer modes?",
      "body": "<p>Yes! Cacti Coast will feature significantly expanded multiplayer options:</p><h4>Online Multiplayer:</h4><ul><li>Co-op Campaign: Play the full story with up to 6 friends online</li><li>Cross-platform Play: Play with friends regardless of their platform</li><li>Drop-in/Drop-out: Friends can join your game anytime</li><li>Voice Chat Integration: Built-in voice communication</li></ul><h4>New Game Modes:</h4><ul><li>Survival Mode: Work together to survive waves of enemies</li><li>Time Trials: Compete for fastest completion times</li><li>Exploration Challenges: Collaborative puzzle-solving mode</li><li>Custom Games: Create your own game rules and challenges</li></ul><h4>Enhanced Local Play:</h4><ul><li>Up to 6 local players: More friends can join the couch co-op experience</li><li>Better camera system: Improved split-screen and shared camera mechanics</li><li>Mixed online/local: Combine local and online players in the same session</li></ul><p>All multiplayer modes are designed to be accessible to players of different skill levels!</p>"
    }
  ]
}