[
  {
    "id": "ncc-announcement",
    "title": "Nocturnals: Cacti Coast Announcement",
    "summary": "We're excited to announce the next game in the Nocturnals series!",
    "body": "<p>After months of development, we're thrilled to reveal Nocturnals: Cacti Coast, the highly anticipated sequel to our beloved indie adventure game.</p><p>This new installment takes players to the sun-baked deserts of Cacti Coast, where new mysteries await and familiar characters return with enhanced abilities and deeper storylines.</p><p>Key features include:</p><ul><li>Expanded world with 3 new biomes</li><li>Online multiplayer for up to 6 players</li><li>Enhanced character customization</li><li>New storyline featuring beloved characters</li></ul><p>Wishlist now on Steam to be notified when the game launches!</p>",
    "image": "images/newsbg-1.jpg",
    "date": "2025-01-15"
  },
  {
    "id": "ludonarracon-sale",
    "title": "40% Off for LudoNarraCon",
    "summary": "We're happy to announce that Nocturnals is on sale May 1st - 5th as part of LudoNarraCon!",
    "body": "<p>We're excited to participate in LudoNarraCon 2025, the premier celebration of narrative-driven games!</p><p>From May 1st through May 5th, you can grab Nocturnals at a massive 40% discount on Steam. This is the perfect opportunity to experience our story-rich adventure if you haven't already.</p><p>LudoNarraCon showcases games that push the boundaries of interactive storytelling, and we're honored to be included alongside so many incredible titles.</p><p>Don't miss out on this limited-time offer - the sale ends May 5th at 11:59 PM PST!</p>",
    "image": "images/newsbg-2.jpg",
    "date": "2025-04-25"
  },
  {
    "id": "stop-killing-games",
    "title": "Our support for Stop Killing Games",
    "summary": "We express our support for the Stop Killing Games campaign in the UK.",
    "body": "<p>As developers who care deeply about game preservation and player rights, Cowboy Toad Games officially supports the Stop Killing Games campaign.</p><p>This important initiative aims to prevent publishers from making games completely unplayable after support ends. We believe that when players purchase a game, they should have reasonable assurance that their purchase will remain functional.</p><p>Our commitment:</p><ul><li>All our games are designed to work offline</li><li>We avoid always-online DRM that could break functionality</li><li>If we ever discontinue a service, we'll provide transition plans</li></ul><p>We encourage other developers to consider the long-term impact of their technical decisions on game preservation.</p><p><a href='https://www.stopkillinggames.com/' target='_blank'>Learn more about the Stop Killing Games campaign</a></p>",
    "image": "images/newsbg-3.jpg",
    "date": "2025-03-10"
  }
]