[
  {
    "id": "privacy-policy",
    "title": "Privacy Policy",
    "body": "<p>Last updated: 08/07/2025</p><p>This Privacy Policy outlines how Cowboy Toad Games LTD (\"we,\" \"us,\" or \"our\") handles your data, how it may be used, and the limited circumstances under which it might be processed when you interact with our games, website, and related services.</p><h4>1. No Active Data Collection</h4><p>We design our games with privacy in mind. None of our games actively collect, track, or transmit any personal information. Specifically:</p><ul><li>We do not collect personal data such as your name, email address, IP address, or payment information.</li><li>We do not use cookies, analytics, advertising identifiers, or tracking technologies within our games.</li><li>We do not transmit gameplay data, preferences, or personal identifiers to our servers or any third party.</li></ul><h4>2. Limited Data Handling</h4><p>While our games themselves do not collect data, some limited usage data may be processed through the third-party services we rely on:</p><ul><li>Cloudflare Analytics: Our website uses <a href=\"https://www.cloudflare.com/privacypolicy/\" target=\"_blank\" rel=\"noopener\">Cloudflare Analytics</a> to monitor traffic and performance. This service uses anonymized data to help improve security and site reliability. We do not use Cloudflare to collect personal information or track users across sites.</li><li>Steam Cloud: If you play our games via Steam, save game data may be stored through Steam Cloud. We do not access or store this data directly. Please refer to the <a href=\"https://store.steampowered.com/privacy_agreement/\" target=\"_blank\" rel=\"noopener\">Steam Privacy Policy</a> for more information.</li></ul><h4>3. Third-Party Platforms</h4><p>Our games may be downloaded and played through third-party platforms, each of which may collect and process data under their own privacy practices. These platforms include:</p><ul><li><a href=\"https://store.steampowered.com/privacy_agreement/\" target=\"_blank\" rel=\"noopener\">Steam (Valve Corporation)</a></li><li><a href=\"https://www.apple.com/legal/privacy/\" target=\"_blank\" rel=\"noopener\">Apple App Store (Apple Inc.)</a></li><li><a href=\"https://policies.google.com/privacy\" target=\"_blank\" rel=\"noopener\">Google Play Store (Google LLC)</a></li></ul><p>We encourage you to review the privacy policies of any platform through which you access our games, as we do not control the data collection practices of these services.</p><h4>4. Children's Privacy</h4><p>Our games are not intended for children under the age of 13, and we do not knowingly collect personal information from children. If you believe that a child has provided us with personal data in violation of this policy, please contact us and we will promptly take steps to remove such information.</p><h4>5. Changes to This Privacy Policy</h4><p>We may update this Privacy Policy from time to time as our products evolve or in response to legal or regulatory changes. All changes will be posted on this page and, where appropriate, we will notify users of material updates.</p><h4>6. Contact Us</h4><p>If you have any questions, concerns, or feedback about this Privacy Policy or our data practices, please contact us at:<br><a href=\"mailto:team@cowboytoad.games\">team@cowboytoad.games</a></p>",
    "date": "2025-07-08"
  },
  {
    "id": "terms-of-use",
    "title": "Terms of Use",
    "body": "<p>Last updated: 08/07/2025</p><p>Welcome to https://cowboytoad.games, operated by Cowboy Toad Games LTD (\"we,\" \"us,\" or \"our\"), a limited company registered in the United Kingdom. By accessing or using this website, you agree to be bound by these Terms of Use. If you do not agree, please do not use our site.</p><h4>1. Use of the Website</h4><p>This website is provided for informational and promotional purposes only. It offers developer news, information about our games, links to third-party storefronts (such as Steam, Google Play, and the Apple App Store), and support resources.</p><p>You are not required to create an account to access any part of our site. We do not host user-submitted content or interactive features on the website.</p><h4>2. Intellectual Property</h4><p>All content, including text, images, artwork, videos, audio, and game assets, is the property of Cowboy Toad Games LTD unless explicitly stated otherwise.</p><p>You may not extract, modify, reproduce, or redistribute assets from our games or website for commercial use or in any way that misrepresents or harms our brand.</p><p>However, we encourage and permit the following:</p><ul><li>Streaming gameplay footage of our games</li><li>Creating fanart</li><li>Using our characters or games in thumbnails and social media posts that promote or discuss our games</li></ul><p>We reserve the right to revoke these permissions if content is deemed misleading, harmful, or inappropriate.</p><h4>3. Discord Server and Community Conduct</h4><p>Our official community discussion takes place on our Discord server. This server is moderated by volunteers, and participation is subject to the following rules:</p><ul><li>Be Respectful: No hate speech, harassment, or personal attacks.</li><li>Keep it Clean: No explicit or offensive content.</li><li>No Spamming: Excessive messaging is not allowed.</li><li>Respect Privacy: Do not share personal information.</li><li>Use Channels Appropriately: Post only relevant content per channel.</li><li>No AI-Generated Art: Fanart channels are for original, human-created artwork only.</li><li>Age Requirements: The Discord server is intended for users aged 16 and older. Users under 16 will be removed. Users under 13 will be permanently banned, in compliance with platform policies and child protection laws.</li></ul><p>Violations may result in removal or bans from the community at the discretion of moderators.</p><h4>4. External Links</h4><p>Our site contains links to third-party websites, such as digital storefronts (Steam, Google Play, Apple App Store), and social platforms (Discord, YouTube). We do not control these sites and are not responsible for their content, privacy policies, or terms. Visiting these sites is at your own risk.</p><h4>5. Age Restrictions</h4><p>Our games are not intended for children under the age of 13, due to mature themes, violence, and strong language. The website itself does not restrict access based on age, but some content may not be suitable for younger audiences.</p><h4>6. Disclaimer</h4><p>This website and its content are provided \"as is,\" without warranty of any kind. We do not guarantee that the site will be error-free or available at all times. We may modify or suspend access to any part of the site without notice.</p><h4>7. Limitation of Liability</h4><p>To the maximum extent permitted by law, Cowboy Toad Games LTD shall not be held liable for any direct, indirect, incidental, or consequential damages arising from your use of the site, its content, or linked services.</p><h4>8. Modifications</h4><p>We reserve the right to update these Terms of Use at any time. Changes will be posted on this page with a new \"Last updated\" date. Continued use of the site after changes are posted implies your acceptance of the revised terms.</p><h4>9. Governing Law</h4><p>These Terms are governed by the laws of England and Wales. Any disputes will be subject to the exclusive jurisdiction of the courts of England and Wales.</p><h4>10. Privacy Policy</h4><p>By using our site, you also agree to our <a href=\"#\" onclick=\"openModal('policy', 'privacy-policy')\">Privacy Policy</a>, which explains how we handle data and user information.</p>",
    "date": "2025-07-08"
  }
]